a52dec
arch-install-scripts
aria2
atool
bandwhich
base
base-devel
bash2048
bat
bat-extras
bc
broot
buku
cmus
ddgr
dust
elinks
emoji-cli
epr-git
faac
faad2
fakeroot-tcp
fblog
fd
ffmpegthumbnailer
fish
flac
fnm
forgit
fx
fzf
gcalcli
git
git-delta
git-extras
git-lfs
github-cli
gitlab-cli
gitmux
gitui
gnupg
googler
grex
has
highlight
hyperfine
img2pdf
jasper
jc
jo
jp
jq
just
keychain
lame
lazygit
lha
libcaca
libdca
libdv
libmad
libmpeg2
libqalculate
libtheora
libvorbis
libxv
lsd
lua-filesystem
luarocks
man-db
mangal-bin
marker
mediainfo
mpd
nano
ncmpcpp
neofetch
neovim
newsboat
nnn
nudoku
nvm
openssh
p7zip
pinentry
pockyt
procs
ranger
rar
ripgrep
rust
sd
shellcheck
shfmt
sudo
tar
tealdeer
texlive-basic
texlive-bibtexextra
texlive-binextra
texlive-doc
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-latexextra
texlive-mathscience
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
tig
tiny
tmux
tokei
transmission-cli
tty-solitaire
ueberzug
unzip
up-git
vim
w3m
wavpack
wget
x264
x265
xclip
xvidcore
yay
yq
yt-dlp
z
zellij
zip
zoxide
zsh
bash2048
buku
emoji-cli
epr-git
fakeroot-tcp
fblog
fnm
forgit
gcalcli
git-extras
gitlab-cli
gitmux
googler
has
jp
lha
mangal-bin
nudoku
nvm
pockyt
rar
tiny
up-git
yay
