# macOS Brewfile
# Nefari0uss

# Homebrew packages
brew 'bash'
brew 'bash-completion'
brew 'binutils'
brew 'chruby'
brew 'colordiff'
brew 'coreutils'
brew 'diffutils'
brew 'dos2unix'
brew 'dtrx'
brew 'emacs'
brew 'ffmpeg'
brew 'findutils'
brew 'fish'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'gnuplot'
brew 'gpg-agent'
brew 'htop'
brew 'imagemagick'
brew 'keychain'
brew 'less'
brew 'links'
brew 'make'
brew 'mas'
brew 'moreutils'
brew 'mosh'
brew 'ncdu'
brew 'neofetch'
brew 'neovim'
brew 'node'
brew 'npm'
brew 'openssh'
brew 'openssl'
brew 'pandoc'
brew 'progress'
brew 'python3'
brew 'r'
brew 'ranger'
brew 'rsync'
brew 'rust'
brew 'tectonic'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'unzip'
brew 'vim', args:['--override-system-vi']
brew 'weechat'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'


# Homebrew Cask Packages
tap 'caskroom/cask'

cask 'alfred'
cask 'amethyst'
cask 'appcode'
cask 'insomniax'
cask 'barabiner-elements'
cask 'calibre'
cask 'cd-to'
cask 'cheatsheet'
cask 'clion'
cask 'dash'
cask 'desmume'
cask 'dolphin'
cask 'dotnet'
cask 'dropbox'
cask 'emacs'
cask 'firefox'
cask 'flux'
cask 'gimp'
cask 'gitup'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iina'
cask 'intellij-idea'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'lastpass'
cask 'league-of-legends'
cask 'libreoffice'
cask 'macvim'
cask 'malwarebytes'
cask 'mpv'
cask 'plex-media-server'
cask 'pycharm'
cask 'retroarch'
cask 'rider'
cask 'skype'
cask 'skype-for-business'
cask 'slack'
cask 'steam'
cask 'telegram'
cask 'the-unarchiver'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'vox'
cask 'webstorm'
cask 'wireshark'

# NTFS Support
cask 'osxfuse'
brew 'ntfs-3g'
brew 'mounty'

# Java is a requirement for the next 3. Also, they are required for Android dev.
cask 'java'
brew 'ant'
brew 'gradle'
brew 'maven'

# Android
cask 'android-sdk'
cask 'android-ndk'
cask 'android-studio'
#cask 'intel-haxm'

# Xamarin
cask 'xamarin'
cask 'xamarin-android'
cask 'xamarin-ios'
cask 'xamarin-mac'

# Unity 3D
cask 'unity'
cask 'unity-android-support-for-editor'
cask 'unity-download-assistant'
cask 'unity-ios-support-for-editor'
cask 'unity-linux-support-for-editor'
cask 'unity-standard-assets'

# Tiling Window Manager
tap 'crisidev/homebrew-chunkwm'
brew 'chunkwm'

# App Store Apps
mas 'Xcode', id: 497799835
