# macOS Brewfile
# Nefari0uss

# Homebrew packages

brew 'ag'
brew 'asciinema'
brew 'aspell'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'bashdb'
brew 'bastet'
brew 'bat'
brew 'binutils'
brew 'ccat'
brew 'chruby'
brew 'cmake'
brew 'cmus'
brew 'colordiff'
brew 'coreutils'
brew 'ctags'
brew 'diffutils'
brew 'docx2txt'
brew 'dos2unix'
brew 'dtrx'
brew 'dtrx'
brew 'elinks'
brew 'emacs-plus'
brew 'exa'
brew 'exif'
brew 'exif'
brew 'exiftool'
brew 'fasd'
brew 'ffmpeg'
brew 'ffmpeg2theora'
brew 'ffmpegthumbnailer'
brew 'findutils', args:['--with-default-names']
brew 'fish'
brew 'flac'
brew 'freetype'
brew 'fzf'
brew 'gawk'
brew 'gdb'
brew 'git'
brew 'git-credential-manager'
brew 'git-extras'
brew 'git-lfs'
brew 'gnu-chess'
brew 'gnu-indent', args:['---with-default-names']
brew 'gnu-sed'
brew 'gnu-sed', args:['---with-default-names']
brew 'gnu-shogi'
brew 'gnu-tar'
brew 'gnu-tar', args:['--with-default-names']
brew 'gnu-which'
brew 'gnu-which', args:['---with-default-names']
brew 'gnupg'
brew 'gnuplot'
brew 'gnutls'
brew 'gpg-agent'
brew 'gpg-agent'
brew 'grep', args:['--with-default-names']
brew 'gzip'
brew 'highlight'
brew 'html2text'
brew 'htop'
brew 'imagemagick'
brew 'jpeg'
brew 'keychain'
brew 'lame'
brew 'less'
brew 'links'
brew 'lua'
brew 'make'
brew 'mas'
brew 'moreutils'
brew 'mosh'
brew 'mpv'
brew 'mutt'
brew 'ncdu'
brew 'ncmpcpp'
brew 'ncurses'
brew 'neofetch'
brew 'neovim'
brew 'netcat'
brew 'ninvaders'
brew 'nnethack'
brew 'nnn'
brew 'node'
brew 'node'
brew 'npm'
brew 'nsnake'
brew 'ntfs-3g'
brew 'nudoku'
brew 'odt2txt'
brew 'openssh'
brew 'openssl'
brew 'opus'
brew 'p7zip'
brew 'pacman4console'
brew 'pacvim'
brew 'pandoc'
brew 'pinentry'
brew 'progress'
brew 'python'
brew 'python3'
brew 'r'
brew 'ranger'
brew 'readline'
brew 'rsync'
brew 'rsync'
brew 'rust'
brew 'screen'
brew 'screen'
brew 'shellformat'
brew 'tectonic'
brew 'tectonic'
brew 'the_silver_searcher'
brew 'theora'
brew 'thfuck'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'unzip'
brew 'vim', args:['--override-system-vi']
brew 'w3m'
brew 'watch'
brew 'wdiff', args:['--with-gettext']
brew 'webp'
brew 'weechat'
brew 'wget'
brew 'wine'
brew 'x264'
brew 'x265'
brew 'xclip'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-completions'

# Homebrew Cask Packages
tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'alfred'
cask 'amethyst'
cask 'anki'
cask 'appcode'
cask 'bitwarden'
cask 'calibre'
cask 'cheatsheet'
cask 'clion'
cask 'cmake'
cask 'cocoarestclient'
cask 'cyberduck'
cask 'dash'
cask 'datagrip'
cask 'desmume'
cask 'discord'
cask 'dolphin'
cask 'dotnet'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'emacs'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'firefoxnightly'
cask 'flux'
cask 'fork'
cask 'gimp'
cask 'gitkraken'
cask 'gitup'
cask 'gnucash'
cask 'godot-mono'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iina'
cask 'insomnia'
cask 'intellij-idea'
cask 'iterm2'
cask 'itsycal'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'keycastr'
cask 'kindle'
cask 'kitty'
cask 'lastpass'
cask 'league-of-legends'
cask 'libreoffice'
cask 'mactex'
cask 'macvim'
cask 'malwarebytes'
cask 'mpv'
cask 'onedrive'
cask 'osxfuse'
cask 'phew'
cask 'plex-media-server'
cask 'pocket-casts'
cask 'postman'
cask 'powershell'
cask 'private-internet-access'
cask 'pycharm'
cask 'renpy'
cask 'retroarch'
cask 'rider'
cask 'skype'
cask 'skype-for-business'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'the-unarchiver'
cask 'tickeys'
cask 'transmission'
cask 'twitch'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'vox'
cask 'webstorm'
cask 'wireshark'
cask 'wraparound'

# Quick Look Extensions
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'webpquicklook'
cask 'quicklookase'
cask 'qlvideo'

# Open JDK
cask tap 'AdoptOpenJDK/openjdk'
cask install adoptopenjdk11

# Java is a requirement for the next 3. Also, they are required for Android dev.
brew 'ant'
brew 'gradle'
brew 'maven'

# Android
cask 'android-studio'
cask 'android-ndk'
cask 'android-platform-tools'

#cask 'intel-haxm'

# Xamarin
cask 'xamarin'
cask 'xamarin-android'
cask 'xamarin-ios'
cask 'xamarin-mac'
cask 'xamarin-jdk'
cask 'xamarin-android-player'

# Unity 3D
cask 'unity'
cask 'unity-android-support-for-editor'
cask 'unity-download-assistant'
cask 'unity-ios-support-for-editor'
cask 'unity-linux-support-for-editor'
cask 'unity-standard-assets'

# Unshallow repo
#git -C "$(brew --repo homebrew/core)" fetch --unshallow

# Tiling Window Manager
tap 'crisidev/homebrew-chunkwm'
brew 'chunkwm'

# App Store Apps
mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
