# macOS Brewfile
# Nefari0uss

# Homebrew packages

brew 'ag'
brew 'bash'
brew 'bash-completion'
brew 'binutils'
brew 'chruby'
brew 'colordiff'
brew 'coreutils'
brew 'diffutils'
brew 'dos2unix'
brew 'dtrx'
brew 'emacs'
brew 'exif'
brew 'exiftool'
brew 'ffmpeg'
brew 'ffmpeg2theora'
brew 'ffmpegthumbnailer'
brew 'findutils', args:['--with-default-names']
brew 'fish'
brew 'flac'
brew 'freetype'
brew 'fzf'
brew 'gawk'
brew 'gawk'
brew 'gdb'
brew 'git'
brew 'git-lfs'
brew 'gnu-indent', args:['---with-default-names']
brew 'gnu-sed', args:['---with-default-names']
brew 'gnu-tar', args:['--with-default-names']
brew 'gnu-which', args:['---with-default-names']
brew 'gnupg'
brew 'gnuplot'
brew 'gnutls'
brew 'gpg-agent'
brew 'grep', args:['--with-default-names']
brew 'gzip'
brew 'html2text'
brew 'htop'
brew 'imagemagick'
brew 'jpeg'
brew 'keychain'
brew 'less'
brew 'links'
brew 'make'
brew 'mas'
brew 'moreutils'
brew 'mosh'
brew 'ncdu'
brew 'neofetch'
brew 'neovim'
brew 'node'
brew 'npm'
brew 'openssh'
brew 'openssl'
brew 'pandoc'
brew 'progress'
brew 'python3'
brew 'r'
brew 'ranger'
brew 'readline'
brew 'rsync'
brew 'rust'
brew 'screen'
brew 'tectonic'
brew 'theora'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'unzip'
brew 'vim', args:['--override-system-vi']
brew 'watch'
brew 'wdiff', args:['--with-gettext']
brew 'weechat'
brew 'wget'
brew 'wget'
brew 'wine'
brew 'xclip'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

# Homebrew Cask Packages
tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'firefoxnightly'
cask 'dotnet-sdk'
cask 'firefoxdeveloperedition'
cask 'private-internet-access'
cask 'alfred'
cask 'amethyst'
cask 'appcode'
cask 'appcode'
cask 'karabiner-elements'
cask 'bartender'
cask 'calibre'
cask 'cd-to'
cask 'cheatsheet'
cask 'clion'
cask 'dash'
cask 'datagrip'
cask 'desmume'
cask 'dolphin'
cask 'dotnet'
cask 'dropbox'
cask 'emacs'
cask 'firefox'
cask 'flux'
cask 'gimp'
cask 'gitup'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iina'
cask 'intellij-idea'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kindle'
cask 'lastpass'
cask 'league-of-legends'
cask 'libreoffice'
cask 'mactex'
cask 'macvim'
cask 'malwarebytes'
cask 'mpv'
cask 'onedrive'
cask 'plex-media-server'
cask 'pycharm'
cask 'retroarch'
cask 'rider'
cask 'rubymine'
cask 'skype'
cask 'skype-for-business'
cask 'slack'
cask 'steam'
cask 'telegram'
cask 'the-unarchiver'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'vox'
cask 'webstorm'
cask 'wireshark'
cask 'spectacle'
cask 'wraparound'

# Quick Look Extensions
brew cask install qlcolorcode qlstephen qlmarkdown quicklook-json qlimagesize webpquicklook suspicious-package quicklookase qlvideo

# Java is a requirement for the next 3. Also, they are required for Android dev.
cask 'java8'
brew 'ant'
brew 'gradle'
brew 'maven'

# Android
cask 'android-studio'
#cask 'android-sdk'
cask 'android-ndk'
cask 'android-platform-tools'

#cask 'intel-haxm'

# Xamarin
cask 'xamarin'
cask 'xamarin-android'
cask 'xamarin-ios'
cask 'xamarin-mac'
cask 'xamarin-jdk'
cask 'xamarin-android-player'

# Unity 3D
cask 'unity'
cask 'unity-android-support-for-editor'
cask 'unity-download-assistant'
cask 'unity-ios-support-for-editor'
cask 'unity-linux-support-for-editor'
cask 'unity-standard-assets'

# Unshallow repo
#git -C "$(brew --repo homebrew/core)" fetch --unshallow

# Tiling Window Manager
tap 'crisidev/homebrew-chunkwm'
brew 'chunkwm'

# App Store Apps
mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
