acpi
albert
alsa-tools
alsa-utils
alsaplayer
android-platform
android-sdk
android-sdk-build-tools
android-sdk-platform-tools
android-studio
android-studio-beta
android-udev
apache-ant
arandr
archey3
asciidoc
asciinema
audacity
autoconf
automake
baobab
bash-completion
beets
binutils
bison
bleachbit
blender
bsd-games
calibre
cfv
chruby
clamav
clion
cmus
colordiff
compton
conky
corebird
cower
deluge
desmume
dhcpcd
dhcpcd-ui
dialog
diffutils
discord
dmenu
dolphin-emu
dotnet
dropbox-cli
dtrx
emacs
fakeroot
feh
file
firefox
firefox-dev
firefox-nightly
fish
flex
gettext
ghetto-skype
gimp
git
git-extras
git-lfs
gnome-twitch
gnome-twitch-player-backend-mpv-opengl
gnuplot
go
google-chrome
gradle
groff
gvim
htop
hwinfo
i3-gaps
i3blocks
i3lock-color-git
i3status
indicator-kdeconnect
inetutils
insomnia
intellij-idea-ultimate-edition
iproute2
iputils
jfsutils
kdeconnect
keepassx2
keychain
komorebi
krita
lastpass
lastpass-cli
libreoffice-fresh
libtool
licenses
lightdm-gtk-greeter-settings
links
linux
linux-headers
logrotate
lshw
lvm2
lynx
m4
make
man-db
man-pages
maven
mdadm
minecraft
mlocate
monodevelop
monodevelop-unity
mosh
mpv
nano
ncdu
neofetch
neovim
network-manager-applet
networkmanager
nodejs
npm
ntp
obs-studio
onedrive-git
openscad
openssh
pacaur
pacgraph
pacman
pandoc-lite
pasystray
patch
pavucontrol
pciutils
pcmciautils
pcsx2
pkg-config
powertop
ppsspp
procps-ng
psmisc
pulseaudio
pulseaudio-alsa
pulseaudio-equalizer
pulseaudio-jack
pycharm-professional
python-pip
python2
quickswitch-i3
r
rambox-bin
ranger
redshift
refind-efi
reiserfsprogs
renpy
retroarch
rfkill
rider
rofi
rsync
rust
s-nail
sagemath
sddm
sed
silver-searcher-git
slack-desktop
slic3r
steam
steam-fonts
steghide
streamlink
sudo
sysfsutils
systemd-sysvcompat
tar
tectonic
telegram-desktop-bin
terminology
texinfo
texlive-core
thunderbird
tlp
tmux
ttf-ms-fonts
txt2tags
tzupdate
ufw
unity-editor
unrar
unzip
usbutils
vbam-gtk
vi
visual-studio-code
vivaldi
w3m
webstorm
weechat
wget
whatsapp-desktop
which
wine
wireshark-gtk
wpa_supplicant
x264
xclip
xdg-user-dirs
xf86-video-intel
xf86-video-vesa
xfsprogs
xorg-appres
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-luit
xorg-mkfontdir
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xdmx
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-server-xwayland
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcalc
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xfontsel
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xlsfonts
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xterm
youtube-dl
zathura-cb
zathura-djvu-git
zathura-pdf-poppler
zathura-ps
zip
zsh
zsh-completions
